In [1]:
import pandas as ps

In [2]:
movies_ps = ps.read_csv('netflix/movie_titles.csv', usecols=[0,1,2])

In [3]:
movies_ps.head()

   ID    Year                         Title
0   1  2003.0               Dinosaur Planet
1   2  2004.0    Isle of Man TT 2004 Review
2   3  1997.0                     Character
3   4  1994.0  Paula Abdul's Get Up & Dance
4   5  2004.0      The Rise and Fall of ECW

In [4]:
rates_ps = ps.read_csv('netflix/rates/part-00.csv')

In [5]:
rates_ps.head()

         date  film_id  user_id  rate
0  1999-11-11     1367   510180     5
1  1999-11-11     1798   510180     5
2  1999-11-11     2866   510180     3
3  1999-11-11     3730   510180     4
4  1999-11-11     3870   510180     2

# Zadanie 1

In [27]:
movies_rates_ps = ps.merge(movies_ps, rates_ps, left_on='ID', right_on='film_id')

In [25]:

movies_ps['ID'].nunique()

17770

In [38]:

movies_rates_ps['ID'].nunique()

4835

In [39]:
movies_rates_uniques_ps = movies_rates_ps.drop_duplicates(subset=['ID'])
movies_rates_uniques_ps.shape

(4835, 8)

# Zadanie 2

Dla każdej dekady premiery filmów utwórz dwa rankingi

- trzech filmów o największej liczbie ocen
- trzech filmów o największej średniej ocen

In [40]:
movies_rates_ps['decade'] = (movies_rates_ps['Year'] // 10) * 10

In [41]:

movies_rates_ps.groupby(['decade', 'ID']).agg({'rate': 'count'}).sort_values(by=['decade', 'rate'], ascending=[True, False]).groupby('decade').head(3).reset_index()

    decade     ID  rate
0   1890.0   7654     4
1   1910.0   8539   121
2   1910.0    394    99
3   1910.0   8821    87
4   1920.0  13798   494
5   1920.0   3223   144
6   1920.0   4249   103
7   1930.0   3605  3125
8   1930.0   7416  2110
9   1930.0  15129   516
10  1940.0  13073  1722
11  1940.0   3315   803
12  1940.0  14134   762
13  1950.0  16223  1327
14  1950.0  10466  1050
15  1950.0    872   886
16  1960.0  11165  2404
17  1960.0  16499  1539
18  1960.0   3684  1441
19  1970.0  10451  4153
20  1970.0   6099  2812
21  1970.0  14358  2592
22  1980.0   7617  5264
23  1980.0  14382  3530
24  1980.0  13580  3371
25  1990.0  16879  6295
26  1990.0  11064  6167
27  1990.0  14725  5810
28  2000.0  12047  2719
29  2000.0   4656  2602
30  2000.0  14313  2341

In [31]:
movies_rates_ps.groupby(['decade', 'ID']).agg({'rate': 'mean'}).sort_values(by=['decade', 'rate'], ascending=[True, False]).groupby('decade').head(3).reset_index()

    decade     ID      rate
0   1890.0   7654  4.000000
1   1910.0  12657  5.000000
2   1910.0   9810  4.250000
3   1910.0   3137  4.000000
4   1920.0   9253  5.000000
5   1920.0   4802  4.200000
6   1920.0   2355  4.000000
7   1930.0  15129  4.036822
8   1930.0   3605  4.016320
9   1930.0  13552  4.000000
10  1940.0   4591  5.000000
11  1940.0   9535  5.000000
12  1940.0  14778  5.000000
13  1950.0    815  5.000000
14  1950.0  11882  5.000000
15  1950.0  15997  5.000000
16  1960.0   2257  5.000000
17  1960.0   2704  5.000000
18  1960.0   3448  5.000000
19  1970.0   2563  5.000000
20  1970.0   4775  5.000000
21  1970.0  13608  5.000000
22  1980.0  10910  5.000000
23  1980.0  14072  5.000000
24  1980.0   8515  4.750000
25  1990.0    709  5.000000
26  1990.0   2271  5.000000
27  1990.0   2479  5.000000
28  2000.0    978  5.000000
29  2000.0   2586  5.000000
30  2000.0   4878  5.000000

## Zadanie 3

Dla trzech wybranych użytkowników, wśród tych, którzy ocenili co najemniej 10 filmów, wyznacz trzy najbardziej rekomendowane filmy do obejrzenia. 

Wskaż źródła opisujące zastosowane przez Ciebie podejście. 

Koniecznie uzupełnij kod szczegółowymi komentarzami.

In [ ]:
rates_ps.groupby('user_id')['rate'].count()

In [ ]:
rates_ps.groupby('user_id').head()